app/Controllers/Home.php

    public function index(): string
    {
        $stmodel = new Student();
        $data['students'] = $stmodel->findAll();
---
SELECT *
FROM `student`

    public function edit($id){
        $stmodel = new Student();
        $data['edit'] = $stmodel->find($id);
        $data['students'] = $stmodel->findAll();
---
SELECT *
FROM `student`
WHERE `student`.`id` = '3'
SELECT *
FROM `student`

    public function save(){
        $stmodel = new Student();
        $id= $this->request->getPost('id');
        $data = array(
            'stid'=>$this->request->getPost('stid'),
            'stname'=>$this->request->getPost('stname'),
            'stclass'=>$this->request->getPost('stclass'),

        );
        if($id){

            $stmodel->update($id,$data);
            return redirect()->to('/')->with("success","Student Updated successfully");
        }
        else{
        $stmodel->insert($data);
---
INSERT INTO `student` (`stid`, `stname`, `stclass`) VALUES ('2', 'Abdullahi mascuud', 'CA202')

    public function delete($id){
        $stmodel = new Student();
        $stmodel->delete($id);
---
DELETE FROM `student`
WHERE `id` IN ('2')